ramanathanaspires/mydeeeeemoapp/ClanCor_HHC/moc/moc_pic32widget.cpp
/****************************************************************************
** Meta object code from reading C++ file 'pic32widget.h'
**
** Created: Tue Feb 11 18:10:44 2014
**      by: The Qt Meta Object Compiler version 62 (Qt 4.6.3)
**
** WARNING! All changes made in this file will be lost!
*****************************************************************************/

#include "../pic32widget.h"
#if !defined(Q_MOC_OUTPUT_REVISION)
#error "The header file 'pic32widget.h' doesn't include <QObject>."
#elif Q_MOC_OUTPUT_REVISION != 62
#error "This file was generated using the moc from 4.6.3. It"
#error "cannot be used with the include files from this version of Qt."
#error "(The moc has changed too much.)"
#endif

QT_BEGIN_MOC_NAMESPACE
static const uint qt_meta_data_Pic32Widget[] = {

 // content:
       4,       // revision
       0,       // classname
       0,    0, // classinfo
       7,   14, // methods
       0,    0, // properties
       0,    0, // enums/sets
       0,    0, // constructors
       0,       // flags
       0,       // signalCount

 // slots: signature, parameters, type, tag, flags
      13,   12,   12,   12, 0x08,
      50,   12,   12,   12, 0x08,
      88,   12,   12,   12, 0x08,
     120,   12,   12,   12, 0x08,
     158,   12,   12,   12, 0x08,
     195,   12,   12,   12, 0x08,
     227,   12,   12,   12, 0x08,

       0        // eod
};

static const char qt_meta_stringdata_Pic32Widget[] = {
    "Pic32Widget\0\0on_pushButton_setBacklight_clicked()\0"
    "on_pushButton_setKeypadMode_clicked()\0"
    "on_pushButton_setBeep_clicked()\0"
    "on_pushButton_setkeypadBeep_clicked()\0"
    "on_pushButton_getMachineId_clicked()\0"
    "on_pushButton_testRTC_clicked()\0"
    "on_pushButton_testPrinter_clicked()\0"
};

const QMetaObject Pic32Widget::staticMetaObject = {
    { &QDialog::staticMetaObject, qt_meta_stringdata_Pic32Widget,
      qt_meta_data_Pic32Widget, 0 }
};

#ifdef Q_NO_DATA_RELOCATION
const QMetaObject &Pic32Widget::getStaticMetaObject() { return staticMetaObject; }
#endif //Q_NO_DATA_RELOCATION

const QMetaObject *Pic32Widget::metaObject() const
{
    return QObject::d_ptr->metaObject ? QObject::d_ptr->metaObject : &staticMetaObject;
}

void *Pic32Widget::qt_metacast(const char *_clname)
{
    if (!_clname) return 0;
    if (!strcmp(_clname, qt_meta_stringdata_Pic32Widget))
        return static_cast<void*>(const_cast< Pic32Widget*>(this));
    return QDialog::qt_metacast(_clname);
}

int Pic32Widget::qt_metacall(QMetaObject::Call _c, int _id, void **_a)
{
    _id = QDialog::qt_metacall(_c, _id, _a);
    if (_id < 0)
        return _id;
    if (_c == QMetaObject::InvokeMetaMethod) {
        switch (_id) {
        case 0: on_pushButton_setBacklight_clicked(); break;
        case 1: on_pushButton_setKeypadMode_clicked(); break;
        case 2: on_pushButton_setBeep_clicked(); break;
        case 3: on_pushButton_setkeypadBeep_clicked(); break;
        case 4: on_pushButton_getMachineId_clicked(); break;
        case 5: on_pushButton_testRTC_clicked(); break;
        case 6: on_pushButton_testPrinter_clicked(); break;
        default: ;
        }
        _id -= 7;
    }
    return _id;
}
QT_END_MOC_NAMESPACE
